train_SM_test_case/generate_data/original_snappy/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    geometry_inlet
    {
        type            zeroGradient;
    }
    geometry_outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    geometry_top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    geometry_obstacle
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    up
    {
        type            empty;
    }
}


// ************************************************************************* //
